{
  "technologies": [
    {
      "category": "Web Development",
      "items": [
        "TypeScript",
        "Angular",
        "RxJS",
        "HTML5/CSS"
      ]
    },
    {
      "category": "Windows Development",
      "items": [
        ".NET Framework",
        "WPF",
        "MVVM",
        "C#"
      ]
    },
    {
      "category": "Development Tools",
      "items": [
        "VS Code",
        "Visual Studio",
        "Git",
        "Gitflow",
        "Chrome and Edge DevTools",
        "Fiddler"
      ]
    }
  ],
  "degrees": [
    {
      "university":"California Polytechnic State University, San Luis Obispo",
      "degree":0,
      "major": "Computer Science",
      "startDate": "1996-09-01T08:00:00.000-09:00",
      "endDate": "2000-12-01T08:00:00.000-09:00"
    }
  ],
  "jobs": [
    {
      "company":  "Grass Valley",
      "city": "Hillsboro, Oregon",
      "title":  "Staff Software Engineer",
      "startDate":  "2005-08-01T07:00:00.000-09:00",
      "duties":  [
        "Lead front-end web developer for GV AMPP Asset Management, a next generation cloud-based platform that facilitates media asset management and remote production for the video broadcast industry.",
        "Helped to design and develop the UI for managing, updating, displaying, and searching across assets and asset metadata.",
        "Worked on the core UI framework which was developed using TypeScript and Angular and was designed to run within a cloud-based microservice architecture.",
        "Helped to design and develop the Windows-based video production and content management application, called GV STRATUS, using C# and WPF.",
        "Participated in the design and development of a configuration and software deployment tool that on-site personnel use to commission and update customers' Grass Valley systems.",
        "Worked on adding new features to an application that managed content for Grass Valley's line of video servers."
      ]
    },
    {
      "company":  "Tektronix, Inc.",
      "city": "Beaverton, Oregon",
      "title":  "Software Engineer (Contractor)",
      "startDate":  "2004-04-01T07:00:00.000-09:00",
      "endDate":  "2005-07-01T08:00:00.000-09:00",
      "duties":  [
        "Worked on the C# Windows-based RF measurement software for the spectrum analyzer product line",
        "Helped to develop the automated nightly build system using scripting."
      ]
    },
    {
      "company":  "Agilent Technologies, Inc.",
      "city": "Santa Rosa, California",
      "title": "Software Engineer",
      "startDate": "2000-06-01T07:00:00.000-09:00",
      "endDate": "2003-03-01T07:00:00.000-09:00",
      "duties": [
        "Developed Windows-based applications that create test signals for satellite and cellular base station testing.",
        "Worked on software to enable importing RF acquisition data directly into Excel spreadsheets or Word documents."
      ]
    },
    {
      "company":  "EducAide Software",
      "city": "Richmond, California",
      "title":  "Data Management",
      "startDate": "1998-06-01T08:00:00.000-09:00",
      "endDate": "1999-12-01T08:00:00.000-09:00",
      "duties":  [
        "Worked on reviewing standardized test questions and adding them into the company’s proprietary database.",
        "Developed macros to facilitate some of this work."
      ]
    }
  ]
}
